# PROYECTO 1

## Ejercicio 1

In [2]:
import pandas as pd
import numpy as np

In [22]:
diccionario = {
    "Fecha": ["12-01-2022","13-01-2022","14-01-2022","15-01-2022"],
    "Precio Unit":[15.50, 3.50, 2.20,5],
    "Ventas":[23, 40, 100, 76]
}

df = pd.DataFrame(diccionario)

In [23]:
df

        Fecha  Precio Unit  Ventas
0  12-01-2022         15.5      23
1  13-01-2022          3.5      40
2  14-01-2022          2.2     100
3  15-01-2022          5.0      76

In [24]:
df['Ganancia'] = df['Ventas']*df['Precio Unit']
df['Ganancia - Desc 5%'] = (df['Precio Unit'] - df['Precio Unit']*0.005).round(2)*df['Ventas']

In [25]:
df

        Fecha  Precio Unit  Ventas  Ganancia  Ganancia - Desc 5%
0  12-01-2022         15.5      23     356.5              354.66
1  13-01-2022          3.5      40     140.0              139.20
2  14-01-2022          2.2     100     220.0              219.00
3  15-01-2022          5.0      76     380.0              377.72

## Ejercicio 2

In [43]:
ingreso = {
    "empleado1":200,
    "empleado2":435,
    "empleado3":567,
    "empleado4":123,
    "empleado5":657,
    "empleado6":876,
    "empleado7":1023
}

tr = pd.DataFrame(ingreso.values())
tr.describe().round(1)

            0
count     7.0
mean    554.4
std     331.6
min     123.0
25%     317.5
50%     567.0
75%     766.5
max    1023.0

## Ejercicio 3

In [30]:
dict3 = {
    "Mes":["Enero", "Febrero", "Marzo", "Abril", "Mayo"],
    "Ventas":[30500, 35600, 28300, 33900, 42500],
    "Gastos":[22000, 23450, 18100, 35700, 32450]
}

In [31]:
df3 = pd.DataFrame(dict3)
df3

       Mes  Ventas  Gastos
0    Enero   30500   22000
1  Febrero   35600   23450
2    Marzo   28300   18100
3    Abril   33900   35700
4     Mayo   42500   32450

In [32]:
# 1. Columna 1 = Gasto/Ventas*100

df3['Columna 1'] = (df3['Gastos']/df3['Ventas'])*100
df3

       Mes  Ventas  Gastos   Columna 1
0    Enero   30500   22000   72.131148
1  Febrero   35600   23450   65.870787
2    Marzo   28300   18100   63.957597
3    Abril   33900   35700  105.309735
4     Mayo   42500   32450   76.352941

In [33]:
# 2. Columna 2 = Si Ventas>= 30000, imprimir “Meta Superada”, caso contrario imprimir “Meta no Superada”.

df3['Columna 2'] = ["Meta superada" if val >= 30000 else "Meta no superada" for val in df3['Ventas']]
df3

       Mes  Ventas  Gastos   Columna 1         Columna 2
0    Enero   30500   22000   72.131148     Meta superada
1  Febrero   35600   23450   65.870787     Meta superada
2    Marzo   28300   18100   63.957597  Meta no superada
3    Abril   33900   35700  105.309735     Meta superada
4     Mayo   42500   32450   76.352941     Meta superada

In [35]:
# 3. Columna 3 = Si Gasto>Ventas, calcular el sobre gasto.
df3['Columna 3'] = np.where(df3['Gastos']>df3['Ventas'], df3['Gastos']-df3['Ventas'], 0)
df3

       Mes  Ventas  Gastos   Columna 1         Columna 2  Columna 3
0    Enero   30500   22000   72.131148     Meta superada          0
1  Febrero   35600   23450   65.870787     Meta superada          0
2    Marzo   28300   18100   63.957597  Meta no superada          0
3    Abril   33900   35700  105.309735     Meta superada       1800
4     Mayo   42500   32450   76.352941     Meta superada          0

In [36]:
# 4. Obtener el total de las ventas de los últimos 3 meses

df3.tail(3)

     Mes  Ventas  Gastos   Columna 1         Columna 2  Columna 3
2  Marzo   28300   18100   63.957597  Meta no superada          0
3  Abril   33900   35700  105.309735     Meta superada       1800
4   Mayo   42500   32450   76.352941     Meta superada          0

In [40]:
# 5. Obtener el total de gastos de febrero a abril
df3[df3['Mes'].isin(['Febrero', 'Marzo', 'Abril'])]

       Mes  Ventas  Gastos   Columna 1         Columna 2  Columna 3
1  Febrero   35600   23450   65.870787     Meta superada          0
2    Marzo   28300   18100   63.957597  Meta no superada          0
3    Abril   33900   35700  105.309735     Meta superada       1800

## Ejercicio 4

In [5]:
df4 = pd.read_csv('Data - Riesgos.csv', index_col='ID')
df4

,edad,meses,max_ant,ingreso,score,tipo_vivienda,zona,nivel,riesgo
ID,,,,,,,,,
2208,33.0,128.0,6.0,3230.00,192.0,2,3.0,2,1
2211,32.0,185.0,7.0,2930.00,217.0,2,1.0,5,1
2212,28.0,NaN,7.0,1883.70,202.0,2,1.0,2,1
2216,56.0,200.0,0.0,850.00,194.0,2,1.0,5,1
2218,32.0,131.0,65.0,3200.00,200.0,2,1.0,2,1
...,...,...,...,...,...,...,...,...,...
1494,54.0,510.0,87.0,24000.00,214.0,2,1.0,2,0
1495,63.0,305.0,99.0,9880.73,219.0,2,5.0,2,0
1496,48.0,194.0,124.0,23000.00,224.0,4,1.0,2,0
1497,39.0,245.0,121.0,12450.00,240.0,4,5.0,2,0
1499,65.0,674.0,38.0,20000.00,238.0,4,5.0,2,0

In [12]:
df4.size

40500

In [11]:
df4.shape

(4500, 9)

In [9]:
columnas = list(df4.columns)
print(columnas)

['edad', 'meses', 'max_ant', 'ingreso', 'score', 'tipo_vivienda', 'zona', 'nivel', 'riesgo']

In [15]:
filas = list(df4.index)
filas

[2208,
 2211,
 2212,
 2216,
 2218,
 2219,
 2226,
 2227,
 2228,
 2230,
 2233,
 2234,
 2235,
 2236,
 2238,
 2240,
 2244,
 2247,
 2248,
 2252,
 2254,
 2258,
 2261,
 2262,
 2263,
 2264,
 2267,
 2269,
 2270,
 2274,
 2276,
 2277,
 2282,
 2285,
 2290,
 2291,
 2292,
 2293,
 2294,
 2295,
 2298,
 2299,
 2300,
 2306,
 2309,
 2310,
 2315,
 2316,
 2317,
 2318,
 2319,
 2322,
 2323,
 2324,
 2325,
 2326,
 2327,
 2328,
 2330,
 2331,
 2334,
 2335,
 2336,
 2337,
 2339,
 2340,
 2341,
 2343,
 2344,
 2347,
 2349,
 2350,
 2351,
 2356,
 2358,
 2359,
 2360,
 2362,
 2363,
 2364,
 2365,
 2366,
 2367,
 2368,
 2370,
 2373,
 2374,
 2375,
 2378,
 2380,
 2381,
 2382,
 2383,
 2384,
 2385,
 2387,
 2389,
 2391,
 2392,
 2394,
 2395,
 2401,
 2402,
 2404,
 2405,
 2408,
 2409,
 2410,
 2411,
 2412,
 2413,
 2415,
 2416,
 2418,
 2420,
 2421,
 2422,
 2424,
 2428,
 2432,
 2434,
 2436,
 2437,
 2438,
 2439,
 2440,
 2441,
 2444,
 2445,
 2446,
 2447,
 2448,
 2449,
 2451,
 2454,
 2455,
 2459,
 2462,
 2463,
 2464,
 2466,
 2467,
 2468,
 2470,
 2472,
 2473,
 2476,
 2480,
 2482,
 2483,
 2486,
 2487,
 2488,
 2489,
 2492,
 2493,
 2495,
 2496,
 2498,
 2499,
 2501,
 2505,
 2507,
 2508,
 2509,
 2512,
 2514,
 2515,
 2518,
 2519,
 2521,
 2523,
 2524,
 2525,
 2526,
 2529,
 2530,
 2531,
 2533,
 2534,
 2535,
 2536,
 2537,
 2538,
 2539,
 2540,
 2543,
 2545,
 2546,
 2547,
 2549,
 2550,
 2551,
 2555,
 2556,
 2557,
 2558,
 2559,
 2560,
 2566,
 2567,
 2568,
 2571,
 2572,
 2578,
 2581,
 2583,
 2584,
 2585,
 2587,
 2589,
 2590,
 2591,
 2592,
 2593,
 2596,
 2598,
 2599,
 2602,
 2604,
 2606,
 2609,
 2612,
 2613,
 2615,
 2616,
 2617,
 2619,
 2621,
 2628,
 2629,
 2634,
 2635,
 2637,
 2638,
 2640,
 2643,
 2644,
 2645,
 2646,
 2654,
 2656,
 2658,
 2660,
 2662,
 2663,
 2664,
 2666,
 2668,
 2669,
 2672,
 2673,
 2675,
 2676,
 2678,
 2679,
 2682,
 2683,
 2687,
 2688,
 2689,
 2691,
 2692,
 2694,
 2697,
 2699,
 2700,
 2703,
 2705,
 2707,
 2710,
 2711,
 2712,
 2713,
 2714,
 2716,
 2717,
 2719,
 2720,
 2721,
 2722,
 2724,
 2725,
 2727,
 2728,
 2732,
 2735,
 2736,
 2738,
 2739,
 2744,
 2745,
 2746,
 2747,
 2749,
 2750,
 2757,
 2758,
 2759,
 2761,
 2763,
 2764,
 2765,
 2766,
 2767,
 2769,
 2770,
 2771,
 2778,
 2782,
 2784,
 2788,
 2789,
 2791,
 2792,
 2799,
 2800,
 2801,
 2802,
 2804,
 2809,
 2811,
 2813,
 2814,
 2815,
 2816,
 2817,
 2819,
 2820,
 2822,
 2823,
 2825,
 2827,
 2831,
 2833,
 2834,
 2835,
 2836,
 2838,
 2839,
 2842,
 2843,
 2845,
 2846,
 2847,
 2848,
 2853,
 2854,
 2856,
 2857,
 2858,
 2859,
 2860,
 2861,
 2862,
 2865,
 2866,
 2869,
 2872,
 2873,
 2874,
 2875,
 2876,
 2882,
 2886,
 2887,
 2890,
 2894,
 2899,
 2900,
 2902,
 2907,
 2908,
 2909,
 2912,
 2913,
 2919,
 2920,
 2921,
 2923,
 2924,
 2926,
 2927,
 2931,
 2932,
 2933,
 2934,
 2936,
 2937,
 2942,
 2943,
 2944,
 2948,
 2949,
 2951,
 2953,
 2954,
 2958,
 2959,
 2960,
 2962,
 2964,
 2968,
 2970,
 2972,
 2973,
 2975,
 2976,
 2977,
 2978,
 2983,
 2984,
 2985,
 2986,
 2988,
 2989,
 2990,
 2993,
 2994,
 2997,
 3000,
 3002,
 3004,
 3008,
 3013,
 3014,
 3015,
 3017,
 3018,
 3020,
 3023,
 3025,
 3026,
 3030,
 3032,
 3033,
 3034,
 3035,
 3036,
 3038,
 3043,
 3044,
 3045,
 3046,
 3047,
 3048,
 3050,
 3053,
 3054,
 3055,
 3058,
 3060,
 3061,
 3064,
 3065,
 3066,
 3068,
 3070,
 3076,
 3077,
 3078,
 3080,
 3081,
 3082,
 3083,
 3087,
 3088,
 3091,
 3092,
 3093,
 3094,
 3095,
 3098,
 3099,
 3101,
 3102,
 3103,
 3104,
 3105,
 3107,
 3108,
 3110,
 3111,
 3112,
 3120,
 3121,
 3122,
 3126,
 3128,
 3129,
 3130,
 3131,
 3132,
 3133,
 3134,
 3135,
 3137,
 3140,
 3141,
 3143,
 3149,
 3153,
 3157,
 3158,
 3160,
 3161,
 3162,
 3164,
 3165,
 3167,
 3170,
 3171,
 3173,
 3174,
 3175,
 3176,
 3177,
 3179,
 3183,
 3184,
 3185,
 3186,
 3188,
 3189,
 3194,
 3196,
 3198,
 3201,
 3202,
 3211,
 3213,
 3214,
 3216,
 3217,
 3218,
 3220,
 3221,
 3222,
 3225,
 3226,
 3229,
 3230,
 3231,
 3233,
 3236,
 3237,
 3241,
 3242,
 3243,
 3247,
 3249,
 3251,
 3252,
 3255,
 3256,
 3257,
 3258,
 3260,
 3261,
 3263,
 3264,
 3266,
 3270,
 3271,
 3273,
 3274,
 3278,
 3280,
 3281,
 3287,
 3290,
 3291,
 3293,
 3296,
 3297,
 3301,
 3303,
 3305,
 3306,
 3307,
 3308,
 3309,
 3310,
 3311,
 3315,
 3317,
 3318,
 3320,
 3321,
 3323,
 3326,
 3328,
 3329,
 3333,
 3334,
 3336,
 3340,
 3341,
 3344,
 3348,
 3349,
 3354,
 3355,
 3357,
 3359,
 3360,
 3361,
 3363,
 3365,
 3368,
 3370,
 3372,
 3374,
 3378,
 3385,
 3386,
 3387,
 3395,
 3396,
 3400,
 3403,
 3404,
 3405,
 3406,
 3410,
 3411,
 3412,
 3414,
 3415,
 3418,
 3419,
 3422,
 3423,
 3424,
 3433,
 3435,
 3439,
 3440,
 3441,
 3443,
 3444,
 3445,
 3449,
 3451,
 3457,
 3458,
 3459,
 3461,
 3464,
 3465,
 3469,
 3470,
 3471,
 3477,
 3478,
 3479,
 3485,
 3486,
 3491,
 3492,
 3496,
 3499,
 3503,
 3504,
 3505,
 3506,
 3507,
 3508,
 3509,
 3511,
 3512,
 3513,
 3518,
 3520,
 3521,
 3522,
 3523,
 3524,
 3525,
 3526,
 3527,
 3528,
 3529,
 3530,
 3531,
 3532,
 3533,
 3536,
 3537,
 3538,
 3539,
 3541,
 3542,
 3544,
 3547,
 3549,
 3550,
 3553,
 3558,
 3562,
 3563,
 3564,
 3568,
 3571,
 3572,
 3575,
 3576,
 3577,
 3579,
 3585,
 3587,
 3589,
 3592,
 3594,
 3595,
 3596,
 3599,
 3603,
 3605,
 3607,
 3608,
 3609,
 3611,
 3612,
 3613,
 3614,
 3620,
 3626,
 3627,
 3629,
 3630,
 3631,
 3636,
 3637,
 3638,
 3639,
 3640,
 3644,
 3645,
 3646,
 3647,
 3649,
 3650,
 3652,
 3657,
 3658,
 3660,
 3662,
 3663,
 3666,
 3668,
 3669,
 3675,
 3678,
 3685,
 3686,
 3689,
 3692,
 3693,
 3696,
 3697,
 3700,
 3702,
 3703,
 3705,
 3706,
 3707,
 3709,
 3712,
 3713,
 3714,
 3716,
 3717,
 3719,
 3721,
 3725,
 3727,
 3728,
 3730,
 3733,
 3734,
 3735,
 3742,
 3744,
 3748,
 3750,
 3751,
 3753,
 3757,
 3758,
 3759,
 3763,
 3764,
 3765,
 3766,
 3767,
 3768,
 3769,
 3770,
 3772,
 3773,
 3774,
 3775,
 3777,
 3779,
 3781,
 3783,
 3784,
 3789,
 3791,
 3795,
 3796,
 3797,
 3799,
 3800,
 3801,
 3803,
 3810,
 3811,
 3812,
 3815,
 3818,
 3819,
 3820,
 3822,
 3826,
 3827,
 3828,
 3829,
 3831,
 3834,
 3835,
 3836,
 3837,
 3838,
 3840,
 3841,
 3842,
 3845,
 3846,
 3848,
 3849,
 3850,
 3851,
 3852,
 3853,
 3855,
 3856,
 3860,
 3861,
 3862,
 3863,
 3864,
 3865,
 3866,
 3868,
 3869,
 3871,
 3872,
 3875,
 3877,
 3878,
 3881,
 3884,
 3885,
 3886,
 3887,
 3888,
 3889,
 3890,
 3896,
 3900,
 3901,
 3904,
 3905,
 3908,
 3909,
 3914,
 3915,
 3916,
 3924,
 3925,
 3926,
 3929,
 3931,
 3933,
 3934,
 3936,
 3939,
 3941,
 3943,
 3945,
 3946,
 3947,
 3948,
 3949,
 3950,
 3954,
 3955,
 3957,
 3965,
 3966,
 3969,
 3973,
 3978,
 3980,
 3982,
 3983,
 3984,
 3985,
 3986,
 3987,
 3989,
 3990,
 3993,
 3996,
 3997,
 4000,
 4004,
 4006,
 4008,
 4009,
 4016,
 4017,
 4024,
 4030,
 4032,
 4037,
 4039,
 4041,
 4044,
 4045,
 4047,
 4048,
 4049,
 4051,
 4055,
 4056,
 4060,
 4061,
 4062,
 4068,
 4069,
 4072,
 4073,
 4075,
 4076,
 4077,
 4078,
 4079,
 4081,
 4082,
 4085,
 4087,
 4088,
 4090,
 4091,
 4092,
 4094,
 4095,
 4099,
 4102,
 4106,
 4109,
 4110,
 4111,
 4112,
 4116,
 4117,
 4119,
 4121,
 4122,
 4123,
 4125,
 4128,
 4129,
 4130,
 4132,
 4134,
 4139,
 4143,
 4145,
 4149,
 4150,
 4152,
 4153,
 4155,
 4156,
 4157,
 4159,
 4161,
 4167,
 4168,
 4169,
 4170,
 4171,
 4172,
 4176,
 4180,
 4181,
 ...]

In [13]:
df4.head(10)

      edad  meses  max_ant  ingreso  score  tipo_vivienda  zona  nivel  riesgo
ID
2208  33.0  128.0      6.0   3230.0  192.0              2   3.0      2       1
2211  32.0  185.0      7.0   2930.0  217.0              2   1.0      5       1
2212  28.0    NaN      7.0   1883.7  202.0              2   1.0      2       1
2216  56.0  200.0      0.0    850.0  194.0              2   1.0      5       1
2218  32.0  131.0     65.0   3200.0  200.0              2   1.0      2       1
2219  34.0  145.0      6.0   7000.0  196.0              2   5.0      2       1
2226   NaN  114.0      0.0   2171.5  178.0              2   2.0      1       1
2227  27.0  116.0      0.0    800.0  169.0              2   1.0      5       1
2228  26.0  182.0      6.0   3150.0  190.0              4   3.0      5       1
2230  25.0  154.0      1.0   2600.0  189.0              2   1.0      2       1

In [14]:
df4.tail(10)

,edad,meses,max_ant,ingreso,score,tipo_vivienda,zona,nivel,riesgo
ID,,,,,,,,,
1486,59.0,288.0,0.0,30000.00,207.0,2,1.0,2,0
1487,55.0,294.0,57.0,9300.00,238.0,4,1.0,2,0
1488,53.0,148.0,106.0,30000.00,219.0,4,1.0,2,0
1491,29.0,198.0,94.0,5250.00,214.0,2,1.0,2,0
1493,32.0,195.0,41.0,7500.00,219.0,2,1.0,2,0
1494,54.0,510.0,87.0,24000.00,214.0,2,1.0,2,0
1495,63.0,305.0,99.0,9880.73,219.0,2,5.0,2,0
1496,48.0,194.0,124.0,23000.00,224.0,4,1.0,2,0
1497,39.0,245.0,121.0,12450.00,240.0,4,5.0,2,0
1499,65.0,674.0,38.0,20000.00,238.0,4,5.0,2,0